
       IDENTIFICATION              DIVISION.
      ******************************************************************
       PROGRAM-ID.                 prog.
      ******************************************************************
       DATA                        DIVISION.
      ******************************************************************
       WORKING-STORAGE             SECTION.
       01 VV PIC S9(4)V9(2).
       01 VP PIC S9(4)PP.
       01 V PIC S9(4).

       01  TEST-DATA-V.
         03 FILLER       PIC S9(4)V9(2) VALUE 0.
         03 FILLER       PIC S9(4)V9(2) VALUE 0.01.
         03 FILLER       PIC S9(4)V9(2) VALUE -0.01.
         03 FILLER       PIC S9(4)V9(2) VALUE 1.01.
         03 FILLER       PIC S9(4)V9(2) VALUE -1.01.
         03 FILLER       PIC S9(4)V9(2) VALUE 10.1.
         03 FILLER       PIC S9(4)V9(2) VALUE -10.1.
         03 FILLER       PIC S9(4)V9(2) VALUE 1234.56.
         03 FILLER       PIC S9(4)V9(2) VALUE 9999.99.
         03 FILLER       PIC S9(4)V9(2) VALUE -9999.99.

       01  TEST-DATA-R-V   REDEFINES TEST-DATA-V.
         03  TEST-TBL-V    OCCURS  10.
           05  D-V             PIC S9(4)V9(2).

       01  TEST-DATA-P.
         03 FILLER       PIC S9(4)PP VALUE 0.
         03 FILLER       PIC S9(4)PP VALUE 100.
         03 FILLER       PIC S9(4)PP VALUE -100.
         03 FILLER       PIC S9(4)PP VALUE 110000.
         03 FILLER       PIC S9(4)PP VALUE -110000.
         03 FILLER       PIC S9(4)PP VALUE 123000.
         03 FILLER       PIC S9(4)PP VALUE -12300.
         03 FILLER       PIC S9(4)PP VALUE 100000.
         03 FILLER       PIC S9(4)PP VALUE 999900.
         03 FILLER       PIC S9(4)PP VALUE -999900.

       01  TEST-DATA-R-P   REDEFINES TEST-DATA-P.
         03  TEST-TBL-P    OCCURS  10.
           05  D-P             PIC S9(4)PP.

       01  TEST-DATA.
         03 FILLER       PIC S9(4) VALUE 0.
         03 FILLER       PIC S9(4) VALUE 1.
         03 FILLER       PIC S9(4) VALUE -1.
         03 FILLER       PIC S9(4) VALUE 10.
         03 FILLER       PIC S9(4) VALUE -10.
         03 FILLER       PIC S9(4) VALUE 100.
         03 FILLER       PIC S9(4) VALUE -100.
         03 FILLER       PIC S9(4) VALUE 1000.
         03 FILLER       PIC S9(4) VALUE 9999.
         03 FILLER       PIC S9(4) VALUE -9999.

       01  TEST-DATA-R   REDEFINES TEST-DATA.
         03  TEST-TBL    OCCURS  10.
           05  D             PIC S9(4).

       01  IDX                     PIC  S9(02).
       01 LOG-COUNT PIC 9999 VALUE 1.

       01 READ-DATA-TBL-V.
         03  READ-TBL-V    OCCURS  10.
           05  READ-DATA-V             PIC S9(4)V9(2).

       01 READ-DATA-TBL-P.
         03  READ-TBL-P    OCCURS  10.
           05  READ-DATA-P             PIC S9(4)PP.

       01 READ-DATA-TBL.
         03  READ-TBL    OCCURS  10.
           05  READ-DATA             PIC S9(4).

OCESQL*EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01  DBNAME                  PIC  X(30) VALUE SPACE.
       01  USERNAME                PIC  X(30) VALUE SPACE.
       01  PASSWD                  PIC  X(10) VALUE SPACE.
OCESQL*EXEC SQL END DECLARE SECTION END-EXEC.

OCESQL*EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".
      ******************************************************************
OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(039) VALUE "SELECT FIELD FROM TESTTABLEV O"
OCESQL  &  "RDER BY N".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0002.
OCESQL     02  FILLER PIC X(039) VALUE "SELECT FIELD FROM TESTTABLEP O"
OCESQL  &  "RDER BY N".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0003.
OCESQL     02  FILLER PIC X(038) VALUE "SELECT FIELD FROM TESTTABLE OR"
OCESQL  &  "DER BY N".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0004.
OCESQL     02  FILLER PIC X(031) VALUE "DROP TABLE IF EXISTS TESTTABLE"
OCESQL  &  "V".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0005.
OCESQL     02  FILLER PIC X(031) VALUE "DROP TABLE IF EXISTS TESTTABLE"
OCESQL  &  "P".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0006.
OCESQL     02  FILLER PIC X(030) VALUE "DROP TABLE IF EXISTS TESTTABLE".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0007.
OCESQL     02  FILLER PIC X(082) VALUE "CREATE TABLE TESTTABLEV ( N NU"
OCESQL  &  "MERIC(2, 0) NOT NULL, FIELD DECIMAL(6, 2) NOT NULL )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0008.
OCESQL     02  FILLER PIC X(082) VALUE "CREATE TABLE TESTTABLEP ( N NU"
OCESQL  &  "MERIC(2, 0) NOT NULL, FIELD NUMERIC(6, 0) NOT NULL )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0009.
OCESQL     02  FILLER PIC X(081) VALUE "CREATE TABLE TESTTABLE ( N NUM"
OCESQL  &  "ERIC(2, 0) NOT NULL, FIELD NUMERIC(4, 0) NOT NULL )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0010.
OCESQL     02  FILLER PIC X(040) VALUE "INSERT INTO TESTTABLEV VALUES "
OCESQL  &  "( $1, $2 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0011.
OCESQL     02  FILLER PIC X(040) VALUE "INSERT INTO TESTTABLEP VALUES "
OCESQL  &  "( $1, $2 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0012.
OCESQL     02  FILLER PIC X(039) VALUE "INSERT INTO TESTTABLE VALUES ("
OCESQL  &  " $1, $2 )".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0013.
OCESQL     02  FILLER PIC X(031) VALUE "DROP TABLE IF EXISTS TESTTABLE"
OCESQL  &  "V".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0014.
OCESQL     02  FILLER PIC X(031) VALUE "DROP TABLE IF EXISTS TESTTABLE"
OCESQL  &  "P".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0015.
OCESQL     02  FILLER PIC X(030) VALUE "DROP TABLE IF EXISTS TESTTABLE".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0016.
OCESQL     02  FILLER PIC X(014) VALUE "DISCONNECT ALL".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       PROCEDURE                   DIVISION.
      ******************************************************************
       MAIN-RTN.

       PERFORM SETUP-DB.

      *    SHOW RESULT
OCESQL*    EXEC SQL
OCESQL*        SELECT FIELD INTO :READ-TBL-V FROM TESTTABLEV ORDER BY N
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 6
OCESQL          BY VALUE -2
OCESQL          BY REFERENCE READ-DATA-V(1)
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetHostTable" USING
OCESQL          BY VALUE 10
OCESQL          BY VALUE 6
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOccurs" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0001
OCESQL          BY VALUE 0
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.

           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
               DISPLAY READ-DATA-V(IDX)
           END-PERFORM.

      *    SHOW RESULT
OCESQL*    EXEC SQL
OCESQL*        SELECT FIELD INTO :READ-TBL-P FROM TESTTABLEP ORDER BY N
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 4
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE READ-DATA-P(1)
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetHostTable" USING
OCESQL          BY VALUE 10
OCESQL          BY VALUE 4
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOccurs" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0002
OCESQL          BY VALUE 0
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.

           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
               DISPLAY READ-DATA-P(IDX)
           END-PERFORM.

      *    SHOW RESULT
OCESQL*    EXEC SQL
OCESQL*        SELECT FIELD INTO :READ-TBL FROM TESTTABLE ORDER BY N
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 4
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE READ-DATA(1)
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetHostTable" USING
OCESQL          BY VALUE 10
OCESQL          BY VALUE 4
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOccurs" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0003
OCESQL          BY VALUE 0
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.

           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
               DISPLAY READ-DATA(IDX)
           END-PERFORM.

       PERFORM CLEANUP-DB.

      *    END
           STOP RUN.

      ******************************************************************
       SETUP-DB.
      ******************************************************************

      *    SERVER
           MOVE  "testdb@db_postgres:5432"
             TO DBNAME.
           MOVE  "main_user"
             TO USERNAME.
           MOVE  "password"
             TO PASSWD.


OCESQL*    EXEC SQL
OCESQL*        CONNECT :USERNAME IDENTIFIED BY :PASSWD USING :DBNAME
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE USERNAME
OCESQL          BY VALUE 30
OCESQL          BY REFERENCE PASSWD
OCESQL          BY VALUE 10
OCESQL          BY REFERENCE DBNAME
OCESQL          BY VALUE 30
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLEV
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0004
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLEP
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0005
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLE
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0006
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*         CREATE TABLE TESTTABLEV
OCESQL*         (
OCESQL*             N         NUMERIC(2,0) NOT NULL,
OCESQL*             FIELD     DECIMAL(6,2) NOT NULL
OCESQL*         )
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0007
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*         CREATE TABLE TESTTABLEP
OCESQL*         (
OCESQL*             N         NUMERIC(2,0) NOT NULL,
OCESQL*             FIELD     NUMERIC(6,0) NOT NULL
OCESQL*         )
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0008
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*         CREATE TABLE TESTTABLE
OCESQL*         (
OCESQL*             N         NUMERIC(2,0) NOT NULL,
OCESQL*             FIELD     NUMERIC(4,0) NOT NULL
OCESQL*         )
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0009
OCESQL     END-CALL.

      *    INSERT ROWS USING HOST VARIABLE
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
              MOVE D-V(IDX)     TO  VV
OCESQL*       EXEC SQL
OCESQL*          INSERT INTO TESTTABLEV VALUES (:IDX, :VV)
OCESQL*       END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE IDX
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 6
OCESQL          BY VALUE -2
OCESQL          BY REFERENCE VV
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0010
OCESQL          BY VALUE 2
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           END-PERFORM.

      *    INSERT ROWS USING HOST VARIABLE
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
              MOVE D-P(IDX)     TO  VP
OCESQL*       EXEC SQL
OCESQL*          INSERT INTO TESTTABLEP VALUES (:IDX, :VP)
OCESQL*       END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE IDX
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 4
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE VP
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0011
OCESQL          BY VALUE 2
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           END-PERFORM.

      *    INSERT ROWS USING HOST VARIABLE
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 10
              MOVE D(IDX)     TO  V
OCESQL*       EXEC SQL
OCESQL*          INSERT INTO TESTTABLE VALUES (:IDX, :V)
OCESQL*       END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE IDX
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 4
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE V
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecParams" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0012
OCESQL          BY VALUE 2
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
           END-PERFORM.

      *    COMMIT
OCESQL*    EXEC SQL
OCESQL*        COMMIT WORK
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "COMMIT" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.

      ******************************************************************
       CLEANUP-DB.
      ******************************************************************
OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLEV
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0013
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLEP
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0014
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DROP TABLE IF EXISTS TESTTABLE
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0015
OCESQL     END-CALL.

OCESQL*    EXEC SQL
OCESQL*        DISCONNECT ALL
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLDisconnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL     END-CALL.



